In [26]:
# librerías para leer y manipular los datos.
import pandas as pd
import numpy as np

## Lectura de los datos

After a brief exploration of the data, I realized that the columns "Vlo-I" and "Vlo-O", which are associated to the numbers of programmed and operated flights respectively, both have numerical and text values. 

**In some cases**, the value of "Vlo-I" is the quite the same as the value of "Vlo-O", but just with one extra letter at the end of the number of the flight (examples: 989 and 989P // 846A and 846). It could be due a mistake when registering the flight or could be another way to label the flight. **In other cases**, the value of "Vlo-O" is actually different as the value of "Vlo-I". 

For "Vlo-I", all but one text values meet the case where the number of the flight is quite the same as the value of "Vlo-O" but just removing the letter at the end of the number. For "Vlo-O", all the text values meet the case described above.

Taking in main all these notes, the **total amount of entries with text values for "Vlo-I" is 5 (five)**, while the **total amount of entries with text values for "Vlo-O" is 16**. 

I took the decision to remove from the dataset all these entries with text values because **they represent aproximately the 0.03% of the total amount of data**, so removing them **should not affect the data, its composition or its distribution**. The **benefits** of removing them are **better handling of the data types, and facilitate the dimensionality reduction**.

In [2]:
data = pd.read_csv("/Users/brandon.hernandez/Documents/Data-scientist-LATAM-challenge/prepared_dataset_SCL.csv")

In [3]:
print(f'The number of entries in the dataset is: {len(data)}')

The number of entries in the dataset is: 68186

## Cleaning the dataframe

In [4]:
# displaying the columns to check whether they were well loaded.
data.columns

Index(['Fecha-I', 'Vlo-I', 'Ori-I', 'Des-I', 'Emp-I', 'Fecha-O', 'Vlo-O',
       'Ori-O', 'Des-O', 'Emp-O', 'DIA', 'MES', 'AÑO', 'DIANOM', 'TIPOVUELO',
       'OPERA', 'SIGLAORI', 'SIGLADES'],
      dtype='object')

In [5]:
# displaying data type of each column.
data.dtypes

Fecha-I       object
Vlo-I          int64
Ori-I         object
Des-I         object
Emp-I         object
Fecha-O       object
Vlo-O        float64
Ori-O         object
Des-O         object
Emp-O         object
DIA            int64
MES            int64
AÑO            int64
DIANOM        object
TIPOVUELO     object
OPERA         object
SIGLAORI      object
SIGLADES      object
dtype: object

In [6]:
# let's delete all rows with NA values in one or more variables.
data = data.dropna()
print(f'After dropping all entries with NA values, the number of total entries is: {len(data)}')

After dropping all entries with NA values, the number of total entries is: 68185

In [7]:
# parsing int64 and float64 values to int32 type.
data["Vlo-I"] = data["Vlo-I"].astype('int32')
data["Vlo-O"] = data["Vlo-O"].astype('int32')
data["DIA"] = data["DIA"].astype('int32')
data["MES"] = data["MES"].astype('int32')
data["AÑO"] = data["AÑO"].astype('int32')

In [8]:
# displaying data type of each column.
data.dtypes

Fecha-I      object
Vlo-I         int32
Ori-I        object
Des-I        object
Emp-I        object
Fecha-O      object
Vlo-O         int32
Ori-O        object
Des-O        object
Emp-O        object
DIA           int32
MES           int32
AÑO           int32
DIANOM       object
TIPOVUELO    object
OPERA        object
SIGLAORI     object
SIGLADES     object
dtype: object

In [9]:
# displaying the data.
data

,Fecha-I,Vlo-I,Ori-I,Des-I,Emp-I,Fecha-O,Vlo-O,Ori-O,Des-O,Emp-O,DIA,MES,AÑO,DIANOM,TIPOVUELO,OPERA,SIGLAORI,SIGLADES
0,2017-01-01 23:30:00,226,SCEL,KMIA,AAL,2017-01-01 23:33:00,226,SCEL,KMIA,AAL,1,1,2017,Domingo,I,American Airlines,Santiago,Miami
1,2017-01-02 23:30:00,226,SCEL,KMIA,AAL,2017-01-02 23:39:00,226,SCEL,KMIA,AAL,2,1,2017,Lunes,I,American Airlines,Santiago,Miami
2,2017-01-03 23:30:00,226,SCEL,KMIA,AAL,2017-01-03 23:39:00,226,SCEL,KMIA,AAL,3,1,2017,Martes,I,American Airlines,Santiago,Miami
3,2017-01-04 23:30:00,226,SCEL,KMIA,AAL,2017-01-04 23:33:00,226,SCEL,KMIA,AAL,4,1,2017,Miercoles,I,American Airlines,Santiago,Miami
4,2017-01-05 23:30:00,226,SCEL,KMIA,AAL,2017-01-05 23:28:00,226,SCEL,KMIA,AAL,5,1,2017,Jueves,I,American Airlines,Santiago,Miami
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
68181,2017-12-22 14:55:00,400,SCEL,SPJC,JAT,2017-12-22 15:41:00,400,SCEL,SPJC,JAT,22,12,2017,Viernes,I,JetSmart SPA,Santiago,Lima
68182,2017-12-25 14:55:00,400,SCEL,SPJC,JAT,2017-12-25 15:11:00,400,SCEL,SPJC,JAT,25,12,2017,Lunes,I,JetSmart SPA,Santiago,Lima
68183,2017-12-27 14:55:00,400,SCEL,SPJC,JAT,2017-12-27 15:35:00,400,SCEL,SPJC,JAT,27,12,2017,Miercoles,I,JetSmart SPA,Santiago,Lima
68184,2017-12-29 14:55:00,400,SCEL,SPJC,JAT,2017-12-29 15:08:00,400,SCEL,SPJC,JAT,29,12,2017,Viernes,I,JetSmart SPA,Santiago,Lima
68185,2017-12-31 14:55:00,400,SCEL,SPJC,JAT,2017-12-31 15:04:00,400,SCEL,SPJC,JAT,31,12,2017,Domingo,I,JetSmart SPA,Santiago,Lima

We have 18 columns with different data type values. As each variable could have different string and numerical values, we need to assess that all the columns provide good information.

In [10]:
clean_df = data.copy()

Getting all the unique values for specific columns, as well as the number of entries for some values

In [11]:
print(f'The unique values for Ori-I variable are: {clean_df["Ori-I"].unique()}')

The unique values for Ori-I variable are: ['SCEL']

In [12]:
print(f'The unique values for Ori-O variable are: {clean_df["Ori-O"].unique()}')

The unique values for Ori-O variable are: ['SCEL']

In [13]:
print(f'The unique values for AÑO variable are: {clean_df["AÑO"].unique()}')
rows_2017 = len(clean_df.query('AÑO==2017'))
rows_2018 = len(clean_df.query('AÑO==2018'))
print(f'The number of entries for 2017 is: {rows_2017}')
print(f'The number of entries for 2018 is: {rows_2018}')

The unique values for AÑO variable are: [2017 2018]
The number of entries for 2017 is: 68183
The number of entries for 2018 is: 2

In [14]:
print(f'The unique values for OPERA variable are: \n{clean_df["OPERA"].unique()}')

The unique values for OPERA variable are:
['American Airlines' 'Air Canada' 'Air France' 'Aeromexico'
 'Aerolineas Argentinas' 'Austral' 'Avianca' 'Alitalia' 'British Airways'
 'Copa Air' 'Delta Air' 'Gol Trans' 'Iberia' 'K.L.M.' 'Qantas Airways'
 'United Airlines' 'Grupo LATAM' 'Sky Airline' 'Latin American Wings'
 'Plus Ultra Lineas Aereas' 'JetSmart SPA' 'Oceanair Linhas Aereas'
 'Lacsa']

In [15]:
print(f'The unique values for TIPOVUELO variable are: {clean_df["TIPOVUELO"].unique()}')
national_fligh = (sum(clean_df['TIPOVUELO']=='N'))
international_flights = sum(clean_df['TIPOVUELO']=='I')
print(f'The number of entries for national flights is: {national_fligh}')
print(f'The number of entries for international flights is: {international_flights}')

The unique values for TIPOVUELO variable are: ['I' 'N']
The number of entries for national flights is: 36957
The number of entries for international flights is: 31228

In [16]:
print(f'The unique values for SIGLAORI variable are: {clean_df["SIGLAORI"].unique()}')

The unique values for SIGLAORI variable are: ['Santiago']

In [17]:
print(f'The unique values for SIGLADES variable are: \n{clean_df["SIGLADES"].unique()}')

The unique values for SIGLADES variable are:
['Miami' 'Dallas' 'Buenos Aires' 'Toronto' 'Paris' 'Ciudad de Mexico'
 'Bogota' 'Roma' 'Londres' 'Ciudad de Panama' 'Atlanta' 'Sao Paulo'
 'Rio de Janeiro' 'Florianapolis' 'Madrid' 'Lima' 'Sydney' 'Houston'
 'Asuncion' 'Cataratas Iguacu' 'Puerto Montt' 'Punta Arenas'
 'Puerto Natales' 'Balmaceda' 'Temuco' 'Valdivia' 'Concepcion' 'La Serena'
 'Copiapo' 'Calama' 'Antofagasta' 'Iquique' 'Arica' 'Mendoza' 'Cordoba'
 'Montevideo' 'Castro (Chiloe)' 'Osorno' 'Orlando' 'Nueva York'
 'Guayaquil' 'Cancun' 'Punta Cana' 'Los Angeles' 'Auckland N.Z.'
 'Isla de Pascua' 'La Paz' 'Santa Cruz' 'Curitiba, Bra.' 'Quito'
 'Bariloche' 'Rosario' 'Washington' 'Tucuman' 'Melbourne' 'San Juan, Arg.'
 'Neuquen' 'Pisco, Peru' 'Ushuia' 'Puerto Stanley' 'Punta del Este'
 'Cochabamba']

In [18]:
# The columns Ori-I and Ori-O have just one value (actually the same value in all their entries)
# The columns will be droped because they do not provide extra information to predict the delay of the flights
columns_to_drop = ['Ori-I', 'Ori-O']
clean_df = clean_df.drop(columns_to_drop, axis=1)

In [19]:
# The AÑO variable has just two different values: 2017 and 2018.
# For 2018 we only have 2 entries, so the entries for 2018 will be dropped.
clean_df = clean_df[clean_df.AÑO != 2018] 
# As we have just one value for the AÑO variable after removing the entries with value of 2018, 
# the variable AÑO will be dropped because it does not provide more information to predict delay of the flights.
clean_df = clean_df.drop("AÑO", axis=1)

In [20]:
# The column "SIGLAORI" is the only one column that still has the same value for each row (Santiago)
# So the column will be dropped because it does not provide more information to predict dalay of the flights
clean_df = clean_df.drop("SIGLAORI", axis=1)

In [21]:
clean_df

,Fecha-I,Vlo-I,Des-I,Emp-I,Fecha-O,Vlo-O,Des-O,Emp-O,DIA,MES,DIANOM,TIPOVUELO,OPERA,SIGLADES
0,2017-01-01 23:30:00,226,KMIA,AAL,2017-01-01 23:33:00,226,KMIA,AAL,1,1,Domingo,I,American Airlines,Miami
1,2017-01-02 23:30:00,226,KMIA,AAL,2017-01-02 23:39:00,226,KMIA,AAL,2,1,Lunes,I,American Airlines,Miami
2,2017-01-03 23:30:00,226,KMIA,AAL,2017-01-03 23:39:00,226,KMIA,AAL,3,1,Martes,I,American Airlines,Miami
3,2017-01-04 23:30:00,226,KMIA,AAL,2017-01-04 23:33:00,226,KMIA,AAL,4,1,Miercoles,I,American Airlines,Miami
4,2017-01-05 23:30:00,226,KMIA,AAL,2017-01-05 23:28:00,226,KMIA,AAL,5,1,Jueves,I,American Airlines,Miami
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
68181,2017-12-22 14:55:00,400,SPJC,JAT,2017-12-22 15:41:00,400,SPJC,JAT,22,12,Viernes,I,JetSmart SPA,Lima
68182,2017-12-25 14:55:00,400,SPJC,JAT,2017-12-25 15:11:00,400,SPJC,JAT,25,12,Lunes,I,JetSmart SPA,Lima
68183,2017-12-27 14:55:00,400,SPJC,JAT,2017-12-27 15:35:00,400,SPJC,JAT,27,12,Miercoles,I,JetSmart SPA,Lima
68184,2017-12-29 14:55:00,400,SPJC,JAT,2017-12-29 15:08:00,400,SPJC,JAT,29,12,Viernes,I,JetSmart SPA,Lima
68185,2017-12-31 14:55:00,400,SPJC,JAT,2017-12-31 15:04:00,400,SPJC,JAT,31,12,Domingo,I,JetSmart SPA,Lima

In [22]:
comparissons = np.where(clean_df['Vlo-I']!=clean_df['Vlo-O'], True, False)
print(sum(comparissons))

100

## Mapping variables

In [ ]:
sns